import telebot
from random import choice as ch
import time
from time import sleep

delay = 0
shabl = ["ти синок шалави полеглий від мого хуя яка тобі витримка взагалі",
"починай мені хуя смоктати я тобі мамашку шлюху все рівно виєбу",
"не намагайся давати якогось виду відпіру всі вже знають що ти терпінь єбаний",
"сруснявий синок шалави ти там не думай що ти на щось то і здатен",
"всі твої мрії я знищу нахуй бо ясен хуй ти ніколи не переможеш мене",
"захаркаю все рівно тебе синка шалавки різаного",
"дивись не налякайся моєї залупи синок шалави відсосний",
"русосвиню єбану тебе ріжу бо така померша одноразка мені нахуй не потрібна",
"прям тут я твою мамашку в рило єбав",
"свинка єбана сруснява ти там в свої сили повірила чи як я це повинен розуміти ?",
"дивись за тиждень не помри на своєму копроботі синок блядухи",
"твою мамашку повію тут з легкістю натягну на свій хуяк",
"на нон стопі ти мені хуй сосав",
"до речі мамашку твою на ура швілив",
"русоблядську мамашку шалашовку різану тут на фарш пустимо",
"і шо ти мені вкинув синок шалави єбаний котрий свої говнотекста зі швидкістю равлика пише а ну пішов нахуй звідси ",
"бігом починай мою залупу до свіркання шліфувати своїм рилом русоблядотним",
"ти померший хряк дивись не відсмокчи знову",
"копротроль єбаний мамашку твою всією конференцією в зад трахали",
"почуй мене та зрозумій що ти на справді не більше ніж насадка для хуя",
"равлика єбаного по лезу пущу",
"я тобі горловину нахуй вскрою синачело слабачки наївної",
"єбали тобі свинорило синку русоблядоти єбаної",
"мамашку тобі різали хуями якщо ти не знав",
"ти синок шалашовки бомжеватий котрий всім давно вже хуй відсмоктав",
"ти як був захарканим слабаком таким і лишився",
"твою кривозубу циганськоподібну мамашку свиню закидали цеглою",
"на гідранти насаджували твою матір її натягнутою виєбаною піздою",
"ти не більше ніж насадка на хуяк всіма відпізжена",
"мамашку твою єбали без зайвих слів",
"трахали тобі рило дегенерату єбаному сука",
"без проблем тобі єбальник переломаю синочку свині сруснявої",
"бомжонок єбаний мамашку тобі виєбемо",
"зуби тобі вирвемо як би ти не чинив опір",
"цеглою переломаю тобі бошку нахуй",
"докажи що ти на щось здатен єбаний ротовиєбаний слабак",
"ти ні в якому разі не зможеш протидіяти мені бо всі вже бачили кожен твій відсос мого хуя",
"дивись там не помри раніше чим планував",
"спробуй відбитись від мене один хуй моментально по єбалу получиш",
"ти тільки там не сильно надійся що твої сили тебе не залишуть коли побачуть справжню швидкість мого письма",
"від рук ти хуй смоктав ось й впав на бота",
"мамашку твою натовпом забили",
"криворилий найслабший свиноруснявий синачело блядоруснявої циганськоподібної шалашовки відсосний тобі в ніякому разі не можна з'являтись тут бо тебе просто напросто чекає смерть ",
"переломаємо копита твоїй жирнішій свиноподібній шалашоматері за всі вчинки котрі вона вчинила",
"покажи свою фантазію русноблядський полумертвий орк котрому єбальник не переломав тільки той кому було впадлу",
"всюди ти мій хуй смоктав та тягав його з собою",
"краще б ти тренував вміння тролитись чим тренував вміння мінету",
"получивши по рилу ти один раз і назавжди зрозумієш що я одночасно з тим як давав тобі піздонів ще й вчив тебе не лізти на українські пеніси без потреби",
"ти голозадий та відпізжений синок шалавки єбаний закрий своє срусняве свинорило нахуй та терпи плевки",
"",
"померлому на пенісі синку шалави я ні шансу не залишу та вб'ю до останнього свинорила єбаного",
"",
"не вихрюкуй більше слабачок свиноруснявий котрий получив по єбалу на перших хвилинах свого говнотролінгу",
"я тобі тут мати повію рильну єбашу без співчуття до тебе",
"нахуй ти руснявий син шалашовки помер тут то",
"свиня блядоруснява я тебе тут так то захаркую, покажи свої сили поки не вмер знову",
"завали єбало своє свиня чорнозуба нахуй та навіть не думай писати сюди щось",
"не трусись від мого хуя безнадіжний говнотроль котрий б ніколи від українського хуя не відмовився ",
"не помирай тут слабак єбаний, продовжуй тужитись щоб показати щось моєму хую",
"твої маневри язиком на пенісі ніколи не були та не будуть актуальними для нормального роду тролів котрі не рипаються на мій хуй",
"який тобі нон стоп слабіший сруснявий син хуйні котрий получає піздонів від мене весь час поки знаходиться в конференції та намагається давити з себе 30 впм",
"сиди та бійся мене так і надалі слабачок свиноблядський котрий вже побачив мою силу",
"якщо ти так і будеш мовчати я без шансів для тебе порву рилище твоїй свиноподібній мамашці шалаві",
"",
"во славу України твою русоблядську матір відсосницю за шкіру підвішаємо на ланцюгах та почнемо знущатись поки вона в свідомості",
"один хуй ти слабіший ротовиєбаний циган до того ще й чорнозубий обожнюючий українські пеніси навіть близько зі мною не стоїш",
"не відривайся від хуя, я ж бачу що ти ловиш кайф від нього",
"твою мамашенцію трахнемо у любому випадку",
"русоблядоті тут матір повію в рило виєбемо поки ніхто не бачить",
"ну так як тобі на смак український хуй синуля шалави свинорилий котрий при любому розкладі мене не переможе?"
' ти слаборозвинена повія терпи мій психотропний хуй за щокою',
            'твого батька ще в армії змушував дупу мені вилизувати',
            ' схибив ти з моїм психотропним членом своєю мовою червивим',
            ' я твою тушку скину з урвища і примушу твою матір винюхувати слід',
            ' збовтав тебе на психотропному члені що все всередині тебе перемішалося',
            'ми якось покличемо твого батька на природне приниження',
            ' твоя мати заспівала мені на вушко що твій страх це мій психотропний пеніс',
            ' я твою уретру виріжу і зроблю так щоб ти більше не зміг нормально функціонувати ',
            ' ти надалі обдумай кожен свій відсмоктувач мені перш ніж писати щось',
            ' я накрутив свій психотропний хуй у вагині твоєї матері що він не зміг спокійно вийти',
            ' твої руки нормально член не тримають як ти взагалі намагався щось зіставити мені',
            'виростив тебе на власній психотропній спермі',
            ' твої сідниці літосферні мій психотропний член поглинули живцем',
            ' одного разу твоя бабака запропонувала свій беззубий відсмоктування своїми яснами трухлявими що я не посмів відмовитися',
            'внутрішньоутробно тебе ебали поки твоє серце ще було в змозі битися',
            'Ти просто не зможеш продовжувати після мого відїб',
            ' ти приймаєш незлічену кількість пенісів',
            'Твоїм подарунком на новий рік буде відірвана головеня твого діда',
            'запру тебе психотропним хуем своїм',
            ' негайно відсмоктав мого психотропного члена як за графіком',
            ' рівень сперми в твоєму організмі зашкалює',
            ' закриваю повіки хуєм твоїй мертвої бабці '
            ' не виебувай син шалави ебучий я тобі один хуй рило зламаю',
            'на кого ти свої виебони крутиш я твою матір ебал',
            ' я твої кістки ебал син повії ',
            'Закину твої вирвані кістки в таз твоєї матері',
            ' продав наркотики на силок роаде твоєї матері вона померла ',
            ' я твою матір ебал своїм психотропним членом син повії',
            'Зношу твоє еблище як психотропний',
            ' закрий своє ебалище син бляді поки я його чисто собі на психотропний член як гондон не натягнув',
            'я в тухлій пізді твоєї матері опаришів розводив',
            ' твоя мати зливається з мого психотропного хуя',
            ' твою матір на пробіжки ебал ранком',
            ' я свій психотропний хуй полоскав у мізках твоєї матері',
            ' ебу твою матір психотропним членом коли сру тобі в рот',
            'натаскаю тебе своїм психотропним членом будеш як професіонал',
            ' психотропний тобі голосові звязки вирвав щоб ти більше не зміг видати криків про допомогу',
            'Гей підор ти смокчеш однотипно тут',
            'Ти відсмоктуєш мій психотропний член заради своїх тупоеблих родаків',
            ' Ти жалюгідна подоба реінкарнації своєї тупоеблой матері бажає завжди бути моєму психотропному члені',
            ' давай лізь назад в утроб своєї матері поки я тебе живцем своїм психотропним пенісом не поховав ',
            ' тріумфально відсмоктав мого психотропного члена і думаєш на цьому все',
            ' я твою матір так то за списком наступну повинен ебать',
            'личинковий ти смоктав внутрішньоутробно',
            ' я твої патли вирву з корінням син повії',
            'Твої потуги, що зносилися, не приносять мені особливого задоволення',
            'Твої ноги вже скосилися від одного руху мого психотропного агрегату в штанах',
            ' лакована будова вагіни твоєї матері не дасть їй розплавитися від мого психотропного хуя',
            ' завжди будь на чеку, інакше не помітиш як я тебе до смерті побю',
            'ти в закулісся мені смоктав психотропний член по швидкому',
            ' твоя мати мого психотропного хуя прагне з нетерпінням',
            'ти через мій психотропний член немов у мікрофон оголосив свій проб',
            'я можу твою матір і всім двором виїбати',
            ' реабілітую тебе своїм психотропним членом',
            'я тебе викину звідси ти навіть не встигнеш схаменутися',
            ' твоя залупа більше не рентабельна після мого психотропного хуя','кинджал в пизду твоєї матері засуну',
            'переріжу твоє ебало на часточки',
            ' на кубики твої мізки переріжу ',
            'ноги вирву тобі синуля повії',
            'відірву твої кінцівки і посмажу на вогнищі, який розведу в черепі твоєї матусі',
            ' порожнину рову твоєї матусі своїм хуєм займу як фортецю',
            'твоєї матері ліктьовий суглоб в інший бік виверну ',
            ' пальці тобі переламаю син повії ебучий ',
            'засмажив матір твою розпяттям у дупу прямо в її ебаной церкви',
            ' пишу на твоєму надгробку що ти син повії ',
            ' ти боїшся мене чи че син повії ',
            ' сльози твоєї матері над твоєю труною впали на мій хуй ',
            'без мого хуя у твоєї матусі гнійна ангіна',
            'у твоєї матусі відморожені пальці відпадають ',
            'твоєї матусі пізду почекав',
            ' без варіантів тобі пиздроване еблище твоє зламаю',
            'Рилище тобі переламаю син повії',
            ' ебучий син повії ебало закрий ',
            'я тобі тут анальне жерло розтрощить',
            'так і бути пізді тобі дам шалаві',
            ' я тобі пилище хуєм скромсаю',
            ' тут ти не знайдеш спокій синуля повії ',
            ' у Голокості твою матір відхуярю ',
            ' твоя мати буде подорожувати від коми до коми',
            ' обличчям вниз синуля повії ',
            ' твоя мати постійно лиже мій хуй як ескімо',
            ' еблище тобі вигну в протилежний бік ',
            'Підведу твою дивну кавалькаду до кінця і поламаю твоє ебало непропорційно твоєму тільцю губка ебуча',
            ' синок шалави ебаний ти че там лапи свої розкинув втомився чи ',
            ' не спи син повії їбучий я все одно твою вежу обоссу тут як будильник ',
            'мудлодзвін твій тут отхуярю до втрати зубного складу',
            'Натягну пизду твоєї матері на паркан',
            ' пізду твоєї матері повісимо в передпокої',
            'перерізали вени твоєї матері у ванні',
            'змусив твою матір жерти уламки кахлю',
            ' куточком каменя продовбав ваги твоєї матусі ',
            ' вушні перетинки твоєї матері залупою полопав',
            'Твоєї матері сунув середньовічний меч в анал і перерізав її кишку зсередини',
            'як самурай перерізав сонну артерію твоєї матері',
            'вирвав трахею твоєї матусі',
            ' Хуець мій царський смоктати будеш свиня ебана',
            ' я твій свинарник спалю нахуй син повії',]
admin_id = 6681270809
chats = []

bot_token = '5821417224:AAG4LoNm54yzN6ljwL6HAa2seNmmlAxWDYo'
bot = telebot.TeleBot(bot_token)

active_spams = {}
auto_reply_chats = set()
auto_reply_users = set()
exception_users = set()
def is_admin(user_id):
    return str(user_id) == str(admin_id)


@bot.message_handler(commands=['chatid'])
def chat_id_handler(message):
    if message.from_user.id == 5836993624:
        chat_id = message.chat.id
        bot.reply_to(message, f"chat_id: {chat_id}")

@bot.message_handler(commands=['gterror'])
def spam_handler(message):
    if message.from_user.id == 5836993624:
        text = message.text.split(maxsplit=1)[1]
        chat_id = int(text.split()[0])
        time_sleep = int(text.split()[1])
        shapka = ' '.join(text.split()[2:])
        shapka_string = str(shapka)
        global chats
        chats.append(chat_id)
        while True:
            if chat_id not in chats:
                break
            if chat_id in chats:
                bot.send_message(chat_id, shapka_string+' '+ch(shabl))
                sleep(time_sleep)

@bot.message_handler(commands=['goff'])
def stop_handler(message):
    if message.from_user.id == 5836993624:
        text = message.text.split(maxsplit=1)[1]
        global chats
        if int(text.split()[0]) in chats:
            chats.remove(int(text.split()[0]))
            bot.reply_to(message, "Сделано!")

@bot.message_handler(commands=['no'])
def add_exception(message):
    user_id = message.from_user.id
    if is_admin(user_id):
        user_id_to_add = extract_user_id_from_command(message.text)
        if user_id_to_add is not None:
            exception_users.add(user_id_to_add)
            bot.reply_to(message, f"виняток додано для користувача з ID: {user_id_to_add}")

@bot.message_handler(commands=['yes'])
def remove_exception(message):
    user_id = message.from_user.id
    if is_admin(user_id):
        user_id_to_remove = extract_user_id_from_command(message.text)
        if user_id_to_remove is not None and user_id_to_remove in exception_users:
            exception_users.remove(user_id_to_remove)
            bot.reply_to(message, f"виняток видалено для користувача з ID: {user_id_to_remove}")

@bot.message_handler(commands=['shapka'])
def set_shapka_command(message):
    global shapka
    user_id = message.from_user.id
    if is_admin(user_id):
        shapka = extract_text_from_command(message.text)
        bot.reply_to(message, f"встановлена шапка: {shapka}")

@bot.message_handler(commands=['atime'])
def set_delay_command(message):
    global delay
    user_id = message.from_user.id
    if is_admin(user_id):
        delay = extract_delay_from_command(message.text)
        bot.reply_to(message, f"затримка встановлена на: {delay} секунд")

@bot.message_handler(commands=['on'])
def enable_auto_reply_global(message):
    user_id = message.from_user.id
    chat_id = extract_chat_id_from_command(message.text)
    if chat_id is not None and is_admin(user_id):
        auto_reply_chats.add(chat_id)
        bot.reply_to(message, f"автоматична відповідь активована у чаті з ID: {chat_id}")

@bot.message_handler(commands=['off'])
def disable_auto_reply_global(message):
    user_id = message.from_user.id
    chat_id = extract_chat_id_from_command(message.text)
    if chat_id is not None and is_admin(user_id):
        auto_reply_chats.remove(chat_id)
        bot.reply_to(message, f"автоматична відповідь вимкнена у чаті з ID: {chat_id}")

@bot.message_handler(commands=['auto'])
def enable_auto_reply(message):
    user_id = extract_user_id_from_command(message.text)
    if user_id:
        auto_reply_users.add(user_id)
        bot.reply_to(message, f"автовідповідач активовано для користувача з ID {user_id}!")
    else:
        bot.reply_to(message, "неправильний формат команди!")

@bot.message_handler(commands=['offauto'])
def disable_auto_reply(message):
    user_id = extract_user_id_from_command(message.text)
    if user_id:
        auto_reply_users.remove(user_id)
        bot.reply_to(message, f"Автовідповідач вимкнено для користувача з ID {user_id}!")
    else:
        bot.reply_to(message, "неправильний формат команди!")

@bot.message_handler(commands=['check'])
def check_bot_status(message):
    user_id = message.from_user.id
    if is_admin(user_id):
        chat_ids = '\n'.join(str(chat_id) for chat_id in auto_reply_chats)
        user_ids = '\n'.join(str(user_id) for user_id in auto_reply_users)
        reply = f"Бот працює у чатах:\n{chat_ids}\n\nБот відповідає на повідомлення акаунтів:\n{user_ids}"
        bot.reply_to(message, reply)

@bot.message_handler(func=lambda message: message.chat.id in auto_reply_chats and message.from_user.id not in exception_users)
def auto_reply_global(message):
    text = ch(shabl)
    time.sleep(delay)
    bot.reply_to(message, shapka + " " + text)

@bot.message_handler(func=lambda message: message.from_user.id in auto_reply_users and message.from_user.id not in exception_users)
def auto_reply_user(message):
    text = ch(shabl)
    time.sleep(delay)
    bot.reply_to(message, shapka + " " + text)

def extract_chat_id_from_command(text):
    try:
        chat_id_str = text.split()[1]
        chat_id = int(chat_id_str)
        return chat_id
    except (IndexError, ValueError):
        return None

def extract_text_from_command(text):
    try:
        return ' '.join(text.split()[1:])
    except IndexError:
        return None

def extract_user_id_from_command(text):
    try:
        user_id_str = text.split()[1]
        user_id = int(user_id_str)
        return user_id
    except (IndexError, ValueError):
        return None

def extract_delay_from_command(text):
    try:
        delay_str = text.split()[1]
        delay = int(delay_str)
        return delay
    except (IndexError, ValueError):
        return None

bot.polling()